app/views/profiles/show.html.erb

<% if current_user.headhunter? %>
  <% if @profile.comments.exists? %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."profile_id" = ?  [["profile_id", 1]]
SELECT 1 AS one FROM "comments" WHERE "comments"."profile_id" = ? LIMIT ?  [["profile_id", 1], ["LIMIT", 1]]