app/views/jobs/show.html.erb

SELECT "profiles".* FROM "profiles" INNER JOIN "apply_jobs" ON "profiles"."id" = "apply_jobs"."profile_id" WHERE "apply_jobs"."job_id" = ?  [["job_id", 1]]
---
  <ul>
      <% @job.profiles.each do |p|%>