app/controllers/apply_jobs_controller.rb

  def new
    @job = Job.find(params[:job_id])
    @profile = Profile.find_by(email: current_user.email)
    if ApplyJob.exists?(profile: @profile, job: @job)
      @apply_job = ApplyJob.find_by(profile: @profile)
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."email" = ? LIMIT ?  [["email", "pedro@gmail.com"], ["LIMIT", 1]]
SELECT "apply_jobs".* FROM "apply_jobs" WHERE "apply_jobs"."profile_id" = ? LIMIT ?  [["profile_id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "apply_jobs" WHERE "apply_jobs"."profile_id" = ? AND "apply_jobs"."job_id" = ? LIMIT ?  [["profile_id", 2], ["job_id", 1], ["LIMIT", 1]]

  def create
    @job = Job.find(params[:job_id])
    @profile = Profile.find_by(email: current_user.email)
    @apply_job = ApplyJob.new(params.require(:apply_job).permit(:cover_letter))
    @apply_job.profile = @profile
    @apply_job.job = @job
    if @apply_job.save
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."email" = ? LIMIT ?  [["email", "pedro@gmail.com"], ["LIMIT", 1]]
INSERT INTO "apply_jobs" ("cover_letter", "profile_id", "job_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cover_letter", "sou foda"], ["profile_id", 2], ["job_id", 1], ["created_at", "2020-05-17 23:38:38.843117"], ["updated_at", "2020-05-17 23:38:38.843117"]]

  def send_reject
    @apply_job = ApplyJob.find(job_id:params[:job_id])
---
SELECT "apply_jobs".* FROM "apply_jobs" WHERE "apply_jobs"."job_id" = ? LIMIT ?  [["job_id", 2], ["LIMIT", 1]]

  def send_reject
    @apply_job = ApplyJob.find(params[:job_id])
---
SELECT "apply_jobs".* FROM "apply_jobs" WHERE "apply_jobs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]