app/controllers/comments_controller.rb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("message", "user_id", "profile_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["message", "teste"], ["user_id", 2], ["profile_id", 1], ["created_at", "2020-05-21 00:02:38.862819"], ["updated_at", "2020-05-21 00:02:38.862819"]]
---
  def create
    @profile = Profile.find(params[:comment][:profile_id])
    @comment = Comment.new(comment_model_params)
    @comment.profile=@profile
    @comment.user= current_user
    if @comment.save