app/controllers/home_controller.rb

  def index
    if current_user.candidate?
      if Profile.exists?(email: current_user.email)
        @profile = Profile.find_by(email: current_user.email)
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."email" = ? LIMIT ?  [["email", "pedro@hotmail.com"], ["LIMIT", 1]]
SELECT 1 AS one FROM "profiles" WHERE "profiles"."email" = ? LIMIT ?  [["email", "lima@gmail.com"], ["LIMIT", 1]]