app/controllers/jobs_controller.rb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."email" = ? LIMIT ?  [["email", "pedro@hotmail.com"], ["LIMIT", 1]]
SELECT 1 AS one FROM "profiles" WHERE "profiles"."email" = ? LIMIT ?  [["email", "pedro@hotmail.com"], ["LIMIT", 1]]
SELECT "profiles".* FROM "profiles" WHERE "profiles"."email" = ? LIMIT ?  [["email", "pedro@hotmail.com"], ["LIMIT", 11]]
---
  def index
    if current_user.candidate?
      @profile = Profile.find_by(email: current_user.email)
      if @profile.social_name.blank? || @profile.formation.blank? ||
        @profile.summary.blank? || @profile.experience.blank?
			  flash[:notice] = 'Por favor finalize seu perfil para utilizar o sistema'
        redirect_to edit_profile_path(@profile)
      else
        @jobs = Job.where("DATE(date_limit) >= ?", Date.today).where(status:0)
        if @jobs.count == 0
          flash[:notice] = 'Nenhuma vaga cadastrada'
          render :index
        end
      end
    else
      @jobs = Job.where(email: current_user.email)

SELECT "level_jobs".* FROM "level_jobs"
---
  def new
    @job = Job.new
    @level_jobs = LevelJob.all

SELECT "level_jobs".* FROM "level_jobs"
---
  def create
    @job = Job.new(job_model_params)
    @job.email = current_user.email
    if @job.save
			redirect_to @job
		else
      @level_jobs = LevelJob.all

SELECT "profiles".* FROM "profiles" WHERE "profiles"."email" = ? LIMIT ?  [["email", "pedro@gmail.com"], ["LIMIT", 1]]
---
  def myjobs
    @profile = Profile.find_by(email: current_user.email)