app/controllers/profiles_controller.rb

  def show
    @profile = Profile.find(params[:id])
    if current_user.headhunter?
      @profile.comments = Comment.where(profile:@profile,user:current_user)
---
SELECT "comments".* FROM "comments" WHERE "comments"."profile_id" = ? AND "comments"."user_id" = ? LIMIT ?  [["profile_id", 2], ["user_id", 2], ["LIMIT", 1]]

  def favorite
    @profile = Profile.find(params[:id])
    if @profile.favorite==1
      @profile.favorite=0
    else
      @profile.favorite=1
    end
    @profile.save
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "profiles" SET "updated_at" = ? WHERE "profiles"."id" = ?  [["updated_at", "2020-05-16 23:25:00.032057"], ["id", 6]]

  def new
    if Profile.exists?(email: current_user.email)
      @profile = Profile.find_by(email: current_user.email)
      if @profile.social_name.blank? || @profile.formation.blank? ||
        @profile.summary.blank? || @profile.experience.blank?
---
SELECT 1 AS one FROM "profiles" WHERE "profiles"."name" = ? AND "profiles"."id" != ? LIMIT ?  [["name", "das"], ["id", 5], ["LIMIT", 1]]