app/controllers/profiles_controller.rb

  def new
    if Profile.exists?(email: current_user.email)
      @profile = Profile.find_by(email: current_user.email)
      if @profile.social_name.blank? || @profile.formation.blank? ||
        @profile.summary.blank? || @profile.experience.blank?
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."email" = ? LIMIT ?  [["email", "pedro@hotmail.com"], ["LIMIT", 1]]
SELECT 1 AS one FROM "profiles" WHERE "profiles"."email" = ? LIMIT ?  [["email", "pedro@hotmail.com"], ["LIMIT", 1]]
SELECT 1 AS one FROM "profiles" WHERE "profiles"."name" = ? AND "profiles"."id" != ? LIMIT ?  [["name", "John Doe Doe"], ["id", 1], ["LIMIT", 1]]

  def create
    @profile = Profile.new(profile_params)
    @profile.email = current_user.email
    if @profile.save
---
INSERT INTO "profiles" ("name", "social_name", "birth_date", "formation", "summary", "experience", "created_at", "updated_at", "email") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @profile = Profile.find(params[:id])
    if @profile.update(profile_params)
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "profiles" SET "social_name" = ?, "formation" = ?, "summary" = ?, "experience" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["social_name", "dsadada"], ["formation", "dsada"], ["summary", "dasda"], ["experience", "dsada"], ["updated_at", "2020-05-17 03:45:00.871332"], ["id", 2]]